{
    "backend": "tensorflow",
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "Dense",
            "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "batch_input_shape": [
                    null,
                    9
                ],
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_regularizer": null,
                "dtype": "float32",
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "name": "dense_1",
                "trainable": true,
                "units": 9,
                "use_bias": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_regularizer": null,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "name": "dense_2",
                "trainable": true,
                "units": 30,
                "use_bias": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_regularizer": null,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "name": "dense_3",
                "trainable": true,
                "units": 20,
                "use_bias": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_regularizer": null,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "name": "dense_4",
                "trainable": true,
                "units": 10,
                "use_bias": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_regularizer": null,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "name": "dense_5",
                "trainable": true,
                "units": 5,
                "use_bias": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "activation": "sigmoid",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_regularizer": null,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "name": "dense_6",
                "trainable": true,
                "units": 1,
                "use_bias": true
            }
        }
    ],
    "keras_version": "2.1.4"
}
